Revit 2026 API

# ConduitSizeIterator Class

---

An iterator to a set of conduit sizes from ConduitSizes.

SystemObject Autodesk.Revit.DB.ElectricalConduitSizeIterator

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ConduitSizeIterator : IEnumerator<ConduitSize>
```
```vb
Public Class ConduitSizeIterator
	Implements IEnumerator(Of ConduitSize)
```
```cpp
public ref class ConduitSizeIterator : IEnumerator<ConduitSize^>
```
```fsharp
type ConduitSizeIterator =
    class
        interface IEnumerator<ConduitSize>
    end
```

The ConduitSizeIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Gets the item at the current position of the iterator. |
|  | CurrentObject |  |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ConduitSizeIterator |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCurrent | Returns the current ConduitSize. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | HasCurrent | Identifies if the iterator has a current item. |
|  | IsDone | Identifies if the iteration has completed. |
|  | MoveNext | Increments the iterator to the next item. |
|  | Reset | Resets the iterator to the initial state. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Electrical Namespace